app/controllers/collection_controller.rb

INSERT INTO "collections" ("name", "category", "total_quizzes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test Sample Collection"], ["category", "Testing"], ["total_quizzes", 3], ["created_at", "2019-09-18 18:11:28.828884"], ["updated_at", "2019-09-18 18:11:28.828884"]]
---
    def new_collection
        collectionName = params[:name]
        collectionCategory = params[:category]
        collectionTotalQuizzes = params[:total_quizzes]
        @collection = Collection.create(:name => collectionName, :category => collectionCategory, :total_quizzes => collectionTotalQuizzes)

SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show_collection_by_id
        @collection = Collection.find(params[:id])

SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "collections" WHERE "collections"."id" = ?  [["id", 2]]
---
    def delete_collection_by_id
        @collection = Collection.find(params[:id])
        if @collection.delete

SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def update_collection_by_id
        updateField = params[:update]
        updateValue = params[:newValue]
        @collection = Collection.find(params[:id])