app/controllers/games_controller.rb

    def start_game
        Rails.logger.info "THE START_GAME FORMAT IS #{request.format}"
        session[:collection_select] = params[:collection_select]
        collection = Collection.find(session[:collection_select])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]