app/controllers/games_controller.rb

SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def start_game
        session[:collection_select] = params[:collection_select]
        collection = Collection.find(session[:collection_select])

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def checkData
        session[:currentQuizId] = params[:quizId]
        session[:currentAnswerId] = params[:answerId]
        quizId = session[:currentQuizId]
        answerId = session[:currentAnswerId]
        if quizId && answerId
            quiz = Quiz.find(quizId)
            answer = Answer.find(answerId)

SELECT "answers".* FROM "answers" WHERE "answers"."quizId" = ?  [["quizId", 1]]
---
    def getData
        quizzes = Quiz.where(collection_id: session[:collection_select])
        if @current_quiz_id
            @quiz = quizzes[@current_quiz_id]
        else
            @quiz = Quiz.find(1)
        end
        @answers = Answer.where(quizId: @quiz.id)