app/controllers/games_controller.rb

    def checkData
        session[:currentQuestionId] = params[:questionId]
        session[:currentAnswerId] = params[:answerId]
        questionId = session[:currentQuestionId]
        answerId = session[:currentAnswerId]
        if questionId && answerId
            question = Question.find(questionId)
            answer = Answer.find(answerId)
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def getData
        questions = Question.where(quiz_id: session[:quiz_select])
        if @current_question_id
            @question = questions[@current_question_id]
        else
            @question = Question.find(1)
        end
        @answers = Answer.where(quizId: @question.id)
---
SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ?  [["quiz_id", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."quizId" = ?  [["quizId", 2]]