app/controllers/game_controller.rb

    def start
        Rails.logger.info "The param collection_id is #{params[:collection_select]}"
        @collection = Collection.find(params[:collection_select])

        @quizzes = Quiz.where(collection_id: params[:collection_select])
        @quiz = @quizzes[0]
        @questions = Answer.where(quizId: @quiz.id)
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."quizId" = ?  [["quizId", 1]]