app/controllers/quiz_controller.rb

SELECT "collections".* FROM "collections"
---
  def quizzes
    @collections = Collection.all

SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new_quiz
    @collection = Collection.find(params[:collection_id])

SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new_quiz_to_collection
    question = params[:question]
    answer = params[:answer]
    @collection = Collection.find(params[:collection_id])