app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "guestUsername"], ["LIMIT", 1]]
---
    def guest_user
      @userToRender = User.find_by_username("guestUsername")

INSERT INTO "users" ("id", "username", "email", "fullName", "bio", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create_guest_user
      @userToRender = FactoryBot.create(:guest_user)