app/controllers/user_controller.rb

  def create
    begin
      @userToRender = User.new
      password_credentials = User.encrypt_password(params[:password])
      password_salt = password_credentials[0]
      password_hash = password_credentials[1]
      password_confirmation_hash = User.encrypt_password(params[:password_confirmation], password_salt)[1]
      @userToRender = User.create(
        :username => params[:username],
        :email => params[:email],
        :password_salt => password_salt,
        :password => password_hash,
        :fullName => params[:fullName],
        :bio => params[:bio],
        :password_confirmation => password_confirmation_hash
        )
---
INSERT INTO "users" ("username", "email", "fullName", "bio", "password", "password_salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)