app/controllers/user_controller.rb

INSERT INTO "users" ("id", "username", "email", "fullName", "bio", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create_guest_user
       guest_user = FactoryBot.create(:guest_user)