app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190964], ["LIMIT", 1]]
---
    def guest_user(with_retry = true)
      if @user
        @userToRender = @user
      else
        @userToRender = User.find(session[:guest_user_id] ||= create_guest_user.id)